tap "hashicorp/tap"
brew "glib"
brew "cairo"
brew "giflib"
brew "harfbuzz"
brew "openjdk"
brew "allure"
brew "awscli"
brew "bat"
brew "cmctl"
brew "eza"
brew "fd"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git-delta"
brew "gitleaks"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "pkgconf"
brew "gobject-introspection"
brew "iperf3"
brew "jpeg"
brew "jq"
brew "kubernetes-cli"
brew "kubeseal"
brew "pango"
brew "librsvg"
brew "mas"
brew "nmap"
brew "node"
brew "pinentry-mac"
brew "pipx"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tree"
brew "vercel-cli"
brew "wakeonlan"
brew "wimlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
cask "brave-browser"
cask "claude"
cask "claude-code"
cask "cursor"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "gpg-suite"
cask "obsidian"
cask "raycast"
cask "requestly"
cask "shottr"
cask "tailscale-app"
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.remote-containers"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evondev.dracula-high-contrast"
vscode "formulahendry.docker-explorer"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "repreng.csv"
vscode "ritwickdey.liveserver"
vscode "yoavbls.pretty-ts-errors"
